cats_99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2019-04-16"], ["color", "white"], ["name", "ff"], ["sex", "M"], ["created_at", "2019-04-30 20:37:20.323483"], ["updated_at", "2019-04-30 20:37:20.323483"]]
---
    def create
        @cat = Cat.new(cat_params)

        if @cat.save